work/WinVent/Kastenfenster/S02/0.orig/CO2relativdensity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2relativdensity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/initialisationConditions"


dimensions      [1 -3 0 0 0 0 0];

internalField  uniform $!internalField/CO2relativdensity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    atmosphere
    {
        type  inletOutlet;
        inletValue uniform $!atmosphere/CO2relativdensity;
        value uniform $!atmosphere/CO2relativdensity;
    }
    

    staticWalls
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
