work/WinVent/Kastenfenster/S02/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
	    type            calculated;
        value           uniform 0;
    }

    outflow
    {
	    type            calculated;
        value           uniform 0;
    }

    staticWalls
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

    window 
    {
        $staticWalls;
    }
    
    "glass_.*"
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0.85; //10; //0.85 
        value           uniform 0;
    }

    
    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
