work/WinVent/Kastenfenster/S02/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.40e-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $inletValue;
    }

    outflow
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $inletValue;
    }

    staticWalls
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    window 
    {
        $staticWalls;
    }

    "glass_.*"
    {
        type            kqRWallFunction;
        value           $internalField;
        //type            kLowReWallFunction;
        //value           uniform 1e-10;
    }

    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
