work/WinVent/Kastenfenster/S02/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            calculated;
        value           $internalField;
    }

    outflow
    {
        type            calculated;
        value           $internalField;
    }

    staticWalls
    {
        type            calculated;
        value           $internalField;
    }

    window 
    {
        $staticWalls;
    }

    "glass_.*"
    {
        type            calculated;
        value           $internalField;
    }

    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
