work/WinVent/Kastenfenster/S02/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        gamma           1;
        value           $internalField;
    }

    staticWalls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    window 
    {
        $staticWalls;
    }

    outflow
    { // no flow through outflow
        type            fixedFluxPressure;
        value           $internalField;
    }
    /*{ // flow through outflow bec. pressure driven
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        gamma           1;
        value           $internalField;
    }*/

    "glass_.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    /*".*"
    {
        type            zeroGradient;
    }*/
}

// ************************************************************************* //
