work/WinVent/Kastenfenster/S02/constant/fvMesh/polyFaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceLabelField;
    location    "constant/fvMesh";
    object      polyFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform -1;

boundaryField
{
    innerInlet
    {
        type            polyFaces;
    }
    atmosphere_outlet
    {
        type            polyFaces;
    }
    rotorBlades
    {
        type            polyFaces;
    }
    rotorBlades_slave
    {
        type            polyFaces;
    }
    walls
    {
        type            polyFaces;
    }
    window
    {
        type            polyFaces;
    }
    nonCouple1
    {
        type            polyFaces;
    }
    nonCouple2
    {
        type            polyFaces;
    }
    nonConformalCyclic_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            1198;
        value           nonuniform List<label> 
1198
(
409729
409730
409731
409732
409733
409734
409735
409736
...
)
;
    }
    nonConformalCyclic_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            1198;
        value           nonuniform List<label> 
1198
(
410913
410914
410915
410916
410917
410918
410919
410920
...
)
;
    }
    nonConformalError_on_nonCouple1
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalError_on_nonCouple2
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
}


// ************************************************************************* //
